autoconfigure/src/test/resources/__files/hello-response.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <greeting xmlns="http://async.test.ru/" xsi:type="xsd:string">Hello</greeting>
    </soapenv:Body>
</soapenv:Envelope>